'''
Создай генератор accumulator(), который:
Накапливает сумму чисел, которые ему посылают через send()
Если ему не отправлять значение (next()), он возвращает текущее значение суммы
На каждом шаге выводит (через print) текущее состояние суммы
Генератор должен корректно завершаться, когда пользователь вызовет close()
gen = accumulator()
next(gen)       # старт, сумма = 0
gen.send(5)     # сумма = 5
gen.send(10)    # сумма = 15
gen.send(-3)    # сумма = 12
gen.close()     # завершение

Вывод в консоли (пример):

Current sum: 0
Current sum: 5
Current sum: 15
Current sum: 12

💡 Подсказки
В генераторе используется current = 0
Для получения значения через send() используют:
value = yield current
value может быть None, если вызвали просто next().
close() корректно завершает генератор.

'''


def accumulator():
    accum = 0
    print(f'\n*****************\nAccumulator -> {accum}\n*****************')
    while True:
        x = yield accum
        if x != None:
            accum += x
            print(f'*****************\nReceived    -> {x}')
            print(f'Accumulator -> {accum}\n*****************')



if __name__ == '__main__':

    gen = accumulator()
    next(gen)
    '''gen.send(3)
    gen.send(5)
    gen.send(2)'''

    #gen.close()

